package level04.lecture16;

/**
 * Created by KGrebenyuk on 17.01.2019.
 */

/*
Достойная оплата труда
Используя цикл вывести на экран сто раз надпись:
"Я никогда не буду работать за копейки. Амиго"
Каждое значение вывести с новой строки.

Требования:
•	Программа не должна считывать текст c клавиатуры.
•	Программа должна выводить текст на экран.
•	Программа должна выводить 100 раз текст указанный в задании.
•	В программе должен использоваться цикл for или цикл while.
*/

public class task0440 {
    public static void main(String[] args) {
       int n = 100;
       while (n>0){
           System.out.println("Я никогда не буду работать за копейки. Амиго");
           n -= 1;
       }
    }
}
