package level03.lecture04;

/**
 * Created by Kgrebenyuk on 03.01.2019.
 */

/*
Я так давно родился
Вывести на экран дату своего рождения в виде:
MAY 1 2012

Требования:
•	Выводимый текст должен содержать месяц, день и год, разделенные пробелом.
•	Название месяца должно выводиться на английском языке и заглавными буквами.
•	Год должен состоять из четырех цифр и быть не меньше 1900.

*/

public class task0305 {
    public static void main(String[] args) {
        System.out.println("JULY 25 1987");
    }
}
